<a href="https://colab.research.google.com/github/Souvik-karmakar/DivineAI_Python/blob/main/Lab_Practise_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [3]:
#Define a function to add the elements present in a tuple.
tup = (1, 3, 6, 1, 10, 7) 
print("The Entered tuple is : " + str(tup)) 
res = sum(list(tup))
print("The sum of tuple elements are : " + str(res))

The Entered tuple is : (1, 3, 6, 1, 10, 7)
The sum of tuple elements are : 28

In [6]:
def add(x):
    y=0
    for i in x:
        y=y+i
    return y
x=(1,2,3,4)
add(x)

NameError: ignored

In [17]:
l1=[56,24,63,90]
l2=[12,85,89,12]
z=(list(zip(l1,l2)))
#According to the 1st element
z.sort(key = lambda x: x[0])
print(z)
#according to the 2nd element
z.sort (key = lambda x: x[1])
print(z)

[(24, 85), (56, 12), (63, 89), (90, 12)]
[(56, 12), (90, 12), (24, 85), (63, 89)]

In [40]:
#open and write to a file 
f=open("file.txt",'r')
try:
  f=open("file.txt")
  f.write("Python Programming")
  
except:
  print("something went wrong") 
f.close()

something went wrong

In [52]:
import pandas as pd
import numpy as np

# crete a sample dataframe
data = pd.DataFrame({
    'age' :     [ 10, 22, 13, 21, 12, 11, 17],
    'section' : [ 'A', 'B', 'C', 'B', 'B', 'A', 'A'],
    'city' :    [ 'Gurgaon', 'Delhi', 'Mumbai', 'Delhi', 'Mumbai', 'Delhi', 'Mumbai'],
    'gender' :  [ 'M', 'F', 'F', 'M', 'M', 'M', 'F'],
    'favourite_color' : [ 'red', np.NAN, 'yellow', np.NAN, 'black', 'green', 'red']
})

# view the data
data

   age section     city gender favourite_color
0   10       A  Gurgaon      M             red
1   22       B    Delhi      F             NaN
2   13       C   Mumbai      F          yellow
3   21       B    Delhi      M             NaN
4   12       B   Mumbai      M           black
5   11       A    Delhi      M           green
6   17       A   Mumbai      F             red

In [55]:
data.loc[(data.age >= 20), ['section', 'city']] = ['S','Pune']

data

   age section     city gender favourite_color
0   10       A  Gurgaon      M             red
1   22       S     Pune      F             NaN
2   13       C   Mumbai      F          yellow
3   21       S     Pune      M             NaN
4   12       B   Mumbai      M           black
5   11       A    Delhi      M           green
6   17       A   Mumbai      F             red

In [79]:
#Qno- By importing required module create a dataframe.Display the dataframe

import pandas as pd
import numpy as np

# create a sample dataframe
data = pd.DataFrame({
    'Brand' : ['Maruti', 'Hyundai', 'Tata', 'Mahindra', 'Maruti', 'Hyundai', 'Renault', 'Tata', 'Maruti'],
     'Year' : [2012, 2014, 2011, 2015, 2012,2016, 2014, 2018, 2019],
    'Kms Driven' : [50000, 30000, 60000,25000, 10000, 46000,31000, 15000, 12000],
     'City' : ['Gurgaon', 'Delhi', 'Mumbai','Delhi', 'Mumbai', 'Delhi','Mumbai','Chennai', 'Ghaziabad'], 
     'Mileage' : [28, 27, 25, 26, 28 , 29, 24, 21, 24]
     })
data

      Brand  Year  Kms Driven       City  Mileage
0    Maruti  2012       50000    Gurgaon       28
1   Hyundai  2014       30000      Delhi       27
2      Tata  2011       60000     Mumbai       25
3  Mahindra  2015       25000      Delhi       26
4    Maruti  2012       10000     Mumbai       28
5   Hyundai  2016       46000      Delhi       29
6   Renault  2014       31000     Mumbai       24
7      Tata  2018       15000    Chennai       21
8    Maruti  2019       12000  Ghaziabad       24

In [73]:
#After creating perform the following set of questions:- 1.selecting cars with brand 'Maruti' and Mileage > 25
#2.selecting range of rows from 2 to 5 
#3.updating values of Mileage if Year < 2015 
#4.selecting 0th, 2th, 4th, and 7th index rows 
#5.selecting rows from 1 to 4 and columns from 2 to 4
data.loc[(data.Brand=='Maruti') & (data.Mileage > 25)]

    Brand  Year  Kms Driven     City  Mileage
0  Maruti  2012       50000  Gurgaon       28
4  Maruti  2012       10000   Mumbai       28

In [78]:
#2
data.loc[2:5]

      Brand  Year  Kms Driven    City  Mileage
2      Tata  2011       60000  Mumbai       25
3  Mahindra  2015       25000   Delhi       26
4    Maruti  2012       10000  Mumbai       28
5   Hyundai  2016       46000   Delhi       29

In [75]:
#4
display(data.iloc[[0,2,4,7]])

    Brand  Year  Kms Driven     City  Mileage
0  Maruti  2012       50000  Gurgaon       28
2    Tata  2011       60000   Mumbai       25
4  Maruti  2012       10000   Mumbai       28
7    Tata  2018       15000  Chennai       21

In [76]:
#5
display(data.iloc[1:5,2:5])

   Kms Driven    City  Mileage
1       30000   Delhi       27
2       60000  Mumbai       25
3       25000   Delhi       26
4       10000  Mumbai       28

In [81]:
#3
data.loc[(data.Year < 2015), 'Mileage'] 
data

      Brand  Year  Kms Driven       City  Mileage
0    Maruti  2012       50000    Gurgaon       28
1   Hyundai  2014       30000      Delhi       27
2      Tata  2011       60000     Mumbai       25
3  Mahindra  2015       25000      Delhi       26
4    Maruti  2012       10000     Mumbai       28
5   Hyundai  2016       46000      Delhi       29
6   Renault  2014       31000     Mumbai       24
7      Tata  2018       15000    Chennai       21
8    Maruti  2019       12000  Ghaziabad       24